## DATA-604

In [4]:
import pandas as pd
import sqlalchemy as sq

In [5]:
# Load the datasets into individual dataframe
avg_rent_df = pd.read_csv("datasets/average_rent_municipality.csv")
avg_rent_df = avg_rent_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "Rental Unit Type": "rental_type",
        "OriginalValue": "value",
    }
)
avg_rent_df = avg_rent_df.drop("CSDUID", axis=1)
avg_rent_df = avg_rent_df.drop("IndicatorSummaryDescription", axis=1)
avg_rent_df = avg_rent_df.drop("UnitOfMeasure", axis=1)
avg_rent_df["municipality"] = avg_rent_df["municipality"].str.lower()
avg_rent_df["rental_type"] = avg_rent_df["rental_type"].str.lower()

avg_rent_df.head()

# Load others

  municipality  year  rental_type  value
0     red deer  1987  1 - bedroom  377.0
1     red deer  1988  1 - bedroom  379.0
2     red deer  1989  1 - bedroom  388.0
3     red deer  1990  1 - bedroom  413.0
4     red deer  1991  1 - bedroom  429.0

In [6]:
# Load the datasets into individual dataframe
oil_production_df = pd.read_csv("datasets/oil_production_municipality.csv")
oil_production_df = oil_production_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "OriginalValue": "value",
    }
)
oil_production_df = oil_production_df.drop("CSDUID", axis=1)
oil_production_df = oil_production_df.drop("IndicatorSummaryDescription", axis=1)
oil_production_df = oil_production_df.drop("UnitOfMeasure", axis=1)
oil_production_df["municipality"] = oil_production_df["municipality"].str.lower()
oil_production_df.head()

  municipality  year   value
0   drumheller  2003  3138.0
1   drumheller  2004  3291.5
2   drumheller  2005  5311.0
3   drumheller  2006  5141.0
4   drumheller  2007  5477.0

In [7]:
# Load the datasets into individual dataframe
natural_gas_production_df = pd.read_csv("datasets/natural_gas_production_municipality.csv")
natural_gas_production_df = natural_gas_production_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "OriginalValue": "value",
    }
)
natural_gas_production_df = natural_gas_production_df.drop("CSDUID", axis=1)
natural_gas_production_df = natural_gas_production_df.drop("IndicatorSummaryDescription", axis=1)
natural_gas_production_df = natural_gas_production_df.drop("UnitOfMeasure", axis=1)
natural_gas_production_df["municipality"] = natural_gas_production_df["municipality"].str.lower()
natural_gas_production_df.head()

  municipality  year     value
0   drumheller  2003  104493.2
1   drumheller  2004  105486.4
2   drumheller  2005  130930.0
3   drumheller  2006  128564.0
4   drumheller  2007  124354.0

In [8]:
# define sql connection here
usersname = 'root'
password = 'root'
database_name = 'project_604'
port = 8899

In [9]:
engine = sq.create_engine(
    f"mysql+mysqlconnector://{usersname}:{password}@localhost:{port}/{database_name}"
)

In [ ]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_rent`;
"""

create_municipalities_rent_table_query = """
CREATE TABLE IF NOT EXISTS `municipalities_rent` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality` VARCHAR(200) NOT NULL,
    `year` YEAR NOT NULL,
    `rental_type` ENUM('2 - bedroom', '3 - bedroom', 'bachelor', '1 - bedroom') NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""

with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_rent_table_query))
    connection.commit()

In [ ]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_oil_production`;
"""

create_municipalities_oil_production_query = """
CREATE TABLE IF NOT EXISTS `municipalities_oil_production` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality` VARCHAR(200) NOT NULL,
    `year` YEAR NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""



with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_oil_production_query))
    connection.commit()

In [ ]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_natural_gas_production`;
"""

create_municipalities_natural_gas_production_query = """
CREATE TABLE IF NOT EXISTS `municipalities_natural_gas_production`(
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality` VARCHAR(200) NOT NULL,
    `year` YEAR NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""



with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_natural_gas_production_query))
    connection.commit()

In [ ]:
# Load the dataframe into the database
avg_rent_df.to_sql('municipalities_rent', engine, if_exists='append', index=False)
oil_production_df.to_sql('municipalities_oil_production', engine, if_exists='append', index=False)
natural_gas_production_df.to_sql('municipalities_natural_gas_production', engine, if_exists='append', index=False)

7708